kvzhao/FreeRTOS-STM32F4/Libraries/STM32F4xx_StdPeriph_Driver/inc/stm32f4_discovery_lis3dsh.h
/*
 * stm32f4_discovery_lis3dsh.h
 *
 *  Created on: Dec 26, 2013
 *      Author: Pawel
 *
 *      IsNo 2013
 *
 *      Akcelerometr MEMS zgodny z LIS3DSH
 *
 */

#ifndef STM32F4_DISCOVERY_LIS3DSH_H_
#define STM32F4_DISCOVERY_LIS3DSH_H_
//==========================================================================================================================

#include "stm32f4xx.h"
//#include "stm32f4xx_gpio.h"
//#include "stm32f4xx_rcc.h"
//#include "stm32f4xx_spi.h"

typedef unsigned char lis3dsh_register;
//-------------------------- struktura inicjalizacji ----------------------------------------------
typedef struct
{
	uint8_t OutputDataRate;
	uint8_t Axes_Enable;
	uint8_t BlockDataUpdate;
}LIS3DSH_InitTypeDef;

typedef struct
{
	short x;
	short y;
	short z;
}LIS3DSH_OutXYZTypeDef;

/* Maximum Timeout values for flags waiting loops. These timeouts are not based
 * on accurate values, they just guarantee that the application will not remain
 * stuck if the SPI communication is corrupted.
 * You may modify these timeout values depending on CPU frequency and application
 * conditions (interrupts routines ...).
*/
#define LIS3DSH_FLAG_TIMEOUT         ((uint32_t)0x1000)


//-------------------------- definicja pinów GPIO -------------------------------------------------
#define LIS3DSH_SPI							SPI1
#define LIS3DSH_SPI_CLK						RCC_APB2Periph_SPI1

#define LIS3DSH_SPI_SCK_PIN					GPIO_Pin_5					// PA.05
#define LIS3DSH_SPI_SCK_GPIO_PORT			GPIOA						// GPIOA
#define LIS3DSH_SPI_SCK_GPIO_CLK			RCC_AHB1Periph_GPIOA
#define LIS3DSH_SPI_SCK_SOURCE				GPIO_PinSource5
#define LIS3DSH_SPI_SCK_AF					GPIO_AF_SPI1

#define LIS3DSH_SPI_MISO_PIN				GPIO_Pin_6					// PA.6
#define LIS3DSH_SPI_MISO_GPIO_PORT			GPIOA						// GPIOA
#define LIS3DSH_SPI_MISO_GPIO_CLK			RCC_AHB1Periph_GPIOA
#define LIS3DSH_SPI_MISO_SOURCE				GPIO_PinSource6
#define LIS3DSH_SPI_MISO_AF					GPIO_AF_SPI1

#define LIS3DSH_SPI_MOSI_PIN				GPIO_Pin_7					// PA.7
#define LIS3DSH_SPI_MOSI_GPIO_PORT			GPIOA						// GPIOA
#define LIS3DSH_SPI_MOSI_GPIO_CLK			RCC_AHB1Periph_GPIOA
#define LIS3DSH_SPI_MOSI_SOURCE				GPIO_PinSource7
#define LIS3DSH_SPI_MOSI_AF					GPIO_AF_SPI1

#define LIS3DSH_SPI_CS_PIN					GPIO_Pin_3					// PE.03
#define LIS3DSH_SPI_CS_GPIO_PORT			GPIOE						// GPIOE
#define LIS3DSH_SPI_CS_GPIO_CLK				RCC_AHB1Periph_GPIOE

#define LIS3DSH_SPI_INT1_PIN				GPIO_Pin_0					// PE.00
#define LIS3DSH_SPI_INT1_GPIO_PORT			GPIOE						// GPIOE
#define LIS3DSH_SPI_INT1_GPIO_CLK			RCC_AHB1Periph_GPIOE
#define LIS3DSH_SPI_INT1_EXTI_LINE			EXTI_Line0
#define LIS3DSH_SPI_INT1_EXTI_PORT_SOURCE	EXTI_PortSourceGPIOE
#define LIS3DSH_SPI_INT1_EXTI_PIN_SOURCE	EXTI_PinSource0
#define LIS3DSH_SPI_INT1_EXTI_IRQn			EXTI0_IRQn

#define LIS3DSH_SPI_INT2_PIN				GPIO_Pin_1					// PE.01
#define LIS3DSH_SPI_INT2_GPIO_PORT			GPIOE						// GPIOE
#define LIS3DSH_SPI_INT2_GPIO_CLK			RCC_AHB1Periph_GPIOE
#define LIS3DSH_SPI_INT2_EXTI_LINE			EXTI_Line1
#define LIS3DSH_SPI_INT2_EXTI_PORT_SOURCE	EXTI_PortSourceGPIOE
#define LIS3DSH_SPI_INT2_EXTI_PIN_SOURCE	EXTI_PinSource1
#define LIS3DSH_SPI_INT2_EXTI_IRQn			EXTI1_IRQn

//-------------------------- definicje rejestrów LIS3DSH ------------------------------------------

/* Rejestr INFO1 -------------- Information register 1 --------------------------------------------
*	Default value: 0x21
*	Read only register
*/
#define LIS3DSH_INFO1_ADDR				0x0d

/* Rejestr INFO2 -------------- Information register 2 --------------------------------------------
*	Default value: 0x00
*	Read only register
*/
#define LIS3DSH_INFO2_ADDR				0x0e

/* Rejestr WHO_AM_I ----------- Who I am ID -------------------------------------------------------
*	Default value: 0x3f
*	Read only register
*/
#define LIS3DSH_WHO_AM_I_ADDR				0x0f
#define _I_AM_LIS3DSH						0X3f

/* Rejestr CTRL_REG3 ---------- Control Register 3 ------------------------------------------------
*	Default value: ---
*	Read/Write register
*
*		bit:
*			7:DR_EN		DRDY signal enable to INT1
*				Default value:0
*				0 = data ready signal not connected
*				1 = data ready signal connected to INT1
*			6:IEA		Interrupt signal polarity
*				Default value:0
*				0 = interrupt signals active LOW
*				1 = interrupt signals active HIGH
*			5:IEL		Interrupt signal latching
*				Default value:0
*				0 = interrupt signals latched
*				1 = interrupt signal pulsed
*			4:INT2_EN	Interrupt 2 enable/disable
*				Default value:0
*				0 = INT2 signal disabled
*				1 = INT2 signal enabled
* 			3:INT1_EN	Interrupt 1 enable/disable
* 				Default Value:0
* 				0 = INT1/DRDY signal disabled
* 				1 = INT1/DRDY signal enabled
* 			2:VFILT		Vector filter enable/disable
* 				Default value:0
* 				0 = vector filter disabled
* 				1 = vector filter enabled
* 			1:---
* 			0:STRT		Soft reset bit
* 				0 = no soft reset
* 				1 = soft reset (POR function)
*/
#define LIS3DSH_CTRL_REG3_ADDR				0x23
#define _LIS3DSH_DR_EN			7
#define _LIS3DSH_IEA			6
#define _LIS3DSH_IEL			5
#define _LIS3DSH_INT2_EN		4
#define _LIS3DSH_INT1_EN		3
#define _LIS3DSH_VFILT			2
#define _LIS3DSH_STRT			0

/*	Rejestr CTRL_REG4 --------- Control Register 4 ------------------------------------------------
*	Default value: ---
*	Read/Write register
*
*		bit:
*			7:ODR3		ODR[3:0]	Output data rate and power mode selection
*			6:ODR2
*			5:ODR1
*			4:ODR0
*				Default value:0000
*				ODR3	ODR2	ODR1	ODR0	ODR-selection
*				 0		 0		 0		 0		power down
*				 0		 0		 0		 1		3.125Hz
*				 0		 0		 1		 0		6.25Hz
*				 0		 0		 1		 1		12.5Hz
*				 0		 1		 0		 0		25Hz
*				 0		 1		 0		 1		50Hz
*				 0		 1		 1		 0		100Hz
*				 0		 1		 1		 1		400Hz
*				 1		 0		 0		 0		800Hz
*				 1		 0		 0		 1		1600Hz
*			3:BDU		Block data update
*				Default value:0
*				0:continuos update
*				1:output registers not updated (until MSB and LSB reading)
*			2:ZEN		Z axis enable
*				Default value:1
*				0:Z axis disabled
*				1:Z axis enabled
*			1:YEN		Y axis enable
*				Default value:1
*				0:Y axis disabled
*				1:Y axis enabled
*			0:XEN		X axis enable
*				Default value:1
*				0=X axis disabled
*				1=X axis enabled
*
*/
#define LIS3DSH_CTRL_REG4_ADDR				0x20
#define _LIS3DSH_ODR3					7
#define _LIS3DSH_ODR2					6
#define _LIS3DSH_ODR1					5
#define _LIS3DSH_ODR0					4
#define _LIS3DSH_BDU					3
#define _LIS3DSH_Z_ENABLE				2
#define _LIS3DSH_YENABLE				1
#define _LIS3DSH_XENABLE				0
#define LIS3DSH_ODR_POWER_DOWN			((uint8_t)0b00000000)
#define LIS3DSH_ODR_3_125_HZ			((uint8_t)0b00010000)
#define LIS3DSH_ODR_6_25_HZ				((uint8_t)0b00100000)
#define LIS3DSH_ODR_12_5_HZ				((uint8_t)0b00110000)
#define LIS3DSH_ODR_25_HZ				((uint8_t)0b01000000)
#define LIS3DSH_ODR_50_HZ				((uint8_t)0b01010000)
#define LIS3DSH_ODR_100_HZ				((uint8_t)0b01100000)
#define LIS3DSH_ODR_400_HZ				((uint8_t)0b01110000)
#define LIS3DSH_ODR_800_HZ				((uint8_t)0b10000000)
#define LIS3DSH_ODR_1600_HZ				((uint8_t)0b10010000)
#define LIS3DSH_XYZ_ENABLE				((uint8_t)0b00000111)
#define LIS3DSH_BDU_CONTINOUS_UPDATE	((uint8_t)0b00000000)
#define LIS3DSH_BDU_NOT_UPDATET			((uint8_t)0b00001000)
/* Rejestr CTRL_REG5 ---------- Control Register 5 ------------------------------------------------
*	Default value: ---
*	Read/Write register
*
*		bit:
*			7:BW2		Anti-aliasing filter bandwidth
*			6:BW1
*				Default value: 00
*				BW2		BW1		BW-selection
*				 0		 0			800 Hz
*				 0		 1			400 Hz
*				 1		 0			200 Hz
*				 1		 1			50 Hz
*			5:FSCALE2	Full-scale selection
*			4:FSCALE1
*			3:FSCALE0
*				Default value: 000
*				FSCALE2	FSCALE1	FSCALE0 FSCALE-selection
*					0		0		0		+/- 2G
*					0		0		1		+/- 4G
*					0		1		0		+/- 6G
*					0		1		1		+/- 8G
*					1		0		0		+/- 16G
*
*			2:ST2		Self-test enable
*			1:ST1
*				Default value: 00
*				ST2		ST1		self-test mode
*				 0		 0		self-test disabled
*				 0		 1		Positive sign self-test
*				 1		 0		Negative sign self-test
*				 1		 1		Not allowed
*			0:SIM		SPI serial interface mode selection
*				Default value: 0
*				0:	4-wire interface
*				1:	3-wire interface
*
*/
#define LIS3DSH_CTRL_REG5_ADDR				0x24
#define _LIS3DSH_BW2						7
#define _LIS3DSH_BW1						6
#define _LIS3DSH_FSCALE2					5
#define _LIS3DSH_FSCALE1					4
#define _LIS3DSH_FSCALE0					3
#define _LIS3DSH_ST2						2
#define _LIS3DSH_ST1						1
#define _LIS3DSH_SIM						0

/* Rejestr CTRL_REG6 ---------- Control Register 6 ------------------------------------------------
*	Default value: ---
*	Read/Write register
*
*		bit:
*			7:BOOT			Force reboot, cleared as soon as the reboot is finished
*				Active: 1
*			6:FIFO_EN		FIFO enable
*				Default value 0
*				0:disable
*				1:enable
*			5:WTM_EN		Enable FIFO Watermark level use
*				Default value: 0
*				0:disable
*				1:enable
*			4:ADD_INC		Register address automatically incremented during a multiple byte access
*							with a serial interface (I2C or SPI)
*				0:disable
*				1:enable
*			3:P1_EMPTY		Enable FIFO Empty indication on int1
*				Default value 0
*				0:disable
*				1:enable
*			2:P1_WTM		FIFO Watermark interrupt on int1
*				Default value 0
*				0:disable
*				1:enable
*			1:P1_OVER_RUN	FIFO overrun interrupt on int1
*				Default value 0
*				0:disable
*				1:enable
*			0:P2_BOOT		BOOT interrupt on int2
*				Default value 0
*				0:disable
*				1:enable
*/
#define LIS3DSH_CTRL_REG6_ADDR				0x25
#define _LIS3DSH_BOOT			7
#define _LIS3DSH_FIFO_EN		6
#define _LIS3DSH_WTM_EN			5
#define _LIS3DSH_ADD_INC		4
#define _LIS3DSH_P1_EMPTY		3
#define _LIS3DSH_P1_WTM			2
#define _LIS3DSH_P1_OVER_RUN	1
#define _LIS3DSH_P2_BOOT		0

/*	Rejestr STATUS ------------- Status Data Register ---------------------------------------------
*	Default value: ---
*	Read only register
*
*		bit:
*			7:ZYXOR		X, Y, and Z axis data overrun
*				Default value: 0
*				0: no overrun has occurred
*				1: a new set of data has overwritten the previous ones
*			6:ZOR		Z axis data overrun
*				Default value: 0
*				0: no overrun has occurred
*				1: a new data for the Z-axis has overwritten the previous one
*			5:YOR		Y axis data overrun
*				Default value: 0
*				0: no overrun has occurred
*				1: a new data for the Y-axis has overwritten the previous one
*			4:XOR		X axis data overrun
*				Default value: 0
*				0: no overrun has occurred
*				1: a new data for the X-axis has overwritten the previous one
*			3:ZYXDA		X, Y, and Z axis new data available
*				Default value: 0
*				0: a new set of data is not yet available
*				1: a new set of data is available
*			2:ZDA		Z axis new data available
*				Default value: 0
*				0: a new data for the Z-axis is not yet available
*				1: a new data for the Z-axis is available
*			1:YDA		Y axis new data available
*				Default value: 0
*				0: a new data for the Y-axis is not yet available
*				1: a new data for the Y-axis is available
*			0:XDA		X axis new data available
*				Default value: 0
*				0: a new data for the X-axis is not yet available
*				1: a new data for the X-axis is available
*/
#define LIS3DSH_STATUS_ADDR					0x27
#define _LIS3DSH_ZYXOR			7
#define _LIS3DSH_ZOR			6
#define _LIS3DSH_YOR			5
#define _LIS3DSH_XOR			4
#define _LIS3DSH_ZYXDA			3
#define _LIS3DSH_ZDA			2
#define _LIS3DSH_YDA			1
#define _LIS3DSH_XDA			0

