kvzhao/FreeRTOS-STM32F4/Libraries/STM32F4xx_StdPeriph_Driver/inc/stm32f4_discovery_lis3dsh.h
/*	Rejestrs ST1_1-ST1_16 ---- SM1 code registers [1-16] ------------------------------------------
*	Default value: ---
*	Write only registers
*
*	State machine 1 system register is made up of 16, 8- bit registers
*	to implement 16-step op-code.
*/
#define LIS3DSH_ST1_1_ADDR					0x40
#define LIS3DSH_ST1_2_ADDR					0x41
#define LIS3DSH_ST1_3_ADDR					0x42
#define LIS3DSH_ST1_4_ADDR					0x43
#define LIS3DSH_ST1_5_ADDR					0x44
#define LIS3DSH_ST1_6_ADDR					0x45
#define LIS3DSH_ST1_7_ADDR					0x46
#define LIS3DSH_ST1_8_ADDR					0x47
#define LIS3DSH_ST1_9_ADDR					0x48
#define LIS3DSH_ST1_10_ADDR					0x49
#define LIS3DSH_ST1_11_ADDR					0x4a
#define LIS3DSH_ST1_12_ADDR					0x4b
#define LIS3DSH_ST1_13_ADDR					0x4c
#define LIS3DSH_ST1_14_ADDR					0x4d
#define LIS3DSH_ST1_15_ADDR					0x4e
#define LIS3DSH_ST1_16_ADDR					0x4f

/*	Rejestr TIM4_1 ----------- SM1 general timer --------------------------------------------------
*	Default value: ---
*	Write only register
*
*	8-bit general timer (unsigned value) for SM1 operation timing.
*/
#define LIS3DSH_TIM4_1_ADDR					0x50

/*	Rejestr TIM3_1 ----------- SM1 general timer --------------------------------------------------
*	Default value: ---
*	Write only register
*
*	8-bit general timer (unsigned value) for SM1 operation timing.
*/
#define LIS3DSH_TIM3_1_ADDR					0x51

/*	Rejestr TIM2_1 ----------- SM1 general timer --------------------------------------------------
*	Default value: ---
*	Write only register
*
*	16-bit general timer (unsigned value) for SM1 operation timing.
*/
#define LIS3DSH_TIM2_1_L_ADDR				0x52
#define LIS3DSH_TIM2_1_H_ADDR				0x53

/*Rejestr TIM1_1 ------------- SM1 general timer --------------------------------------------------
*	Default value: ---
*	Write only register
*
*	16-bit general timer (unsigned value) for SM1 operation timing.
*/
#define LIS3DSH_TIM1_1_L_ADDR				0x54
#define LIS3DSH_TIM1_1_H_ADDR				0x55

/*	Rejestr THRS2_1 ---------- SM1 threshold value 1 ----------------------------------------------
*	Default value: ---
*	Write only register
*
*	Threshold value for SM1 operation.
*/
#define LIS3DSH_THRS2_1_ADDR				0x56

/*	Rejestr THRS1_1 ---------- SM1 threshold value 2 ----------------------------------------------
*	Default value: ---
*	Write only register
*
*	Threshold value for SM1 operation.
*/
#define LIS3DSH_THRS1_1_ADDR				0x57

/*	Rejestr MASK1_B ---------- SM1 axis and sign mask ---------------------------------------------
*	Default value: ---
*	Write only register
*
*	Axis and sign mask (swap) for SM1 motion detection operation.
*
*		bit:
*			7:P_X
*				0: X + disabled
*				1: X + enabled
*			6:N_X
*				0: X - disabled
*				1: X – enabled
*			5:P_Y
*				0: X + disabled
*				1: X + enabled
*			4:N_Y
*				0: X - disabled
*				1: X – enabled
*			3:P_Z
*				0: X + disabled
*				1: X + enabled
*			2:N_Z
*				0: X - disabled
*				1: X – enabled
*			1:P_V
*				0: X + disabled
*				1: X + enabled
*			0:N_V
*				0: X - disabled
*				1: X – enabled
*/
#define LIS3DSH_MASK1_B_ADDR				0x59
#define _LIS3DSH_P_X		7
#define _LIS3DSH_N_X		6
#define _LIS3DSH_P_Y		5
#define _LIS3DSH_N_Y		4
#define _LIS3DSH_P_Z		3
#define _LIS3DSH_N_Z		2
#define _LIS3DSH_P_V		1
#define _LIS3DSH_N_V		0

/*	Rejestr MASK1_A ---------- SM1 axis and sign mask ---------------------------------------------
*	Default value: ---
*	Write only register
*
*	Axis and sign mask (default) for SM1 motion detection operation.
*
*		bit:
*			7:P_X
*				0: X + disabled
*				1: X + enabled
*			6:N_X
*				0: X - disabled
*				1: X – enabled
*			5:P_Y
*				0: X + disabled
*				1: X + enabled
*			4:N_Y
*				0: X - disabled
*				1: X – enabled
*			3:P_Z
*				0: X + disabled
*				1: X + enabled
*			2:N_Z
*				0: X - disabled
*				1: X – enabled
*			1:P_V
*				0: X + disabled
*				1: X + enabled
*			0:N_V
*				0: X - disabled
*				1: X – enabled
*/
#define LIS3DSH_MASK1_A_ADDR				0x5a
#define _LIS3DSH_P_X		7
#define _LIS3DSH_N_X		6
#define _LIS3DSH_P_Y		5
#define _LIS3DSH_N_Y		4
#define _LIS3DSH_P_Z		3
#define _LIS3DSH_N_Z		2
#define _LIS3DSH_P_V		1
#define _LIS3DSH_N_V		0

/*	Rejestr SETT1 ------------ SM1 detection settings ---------------------------------------------
*	Default value: ---
*	Write only register
*
*	Setting of threshold, peak detection and flags for SM1 motion detection operation.
*
*		bit:
*			7:P_DET		SM1 peak detection
*				Default value:0
*				0: peak detection disabled
*				1: peak detection enabled
*			6:THR3_SA
*				Default value:0
*				0: no action
*				1: threshold 3 limit value for axis and sign mask reset (MASKB_1)
*			5:ABS
*				Default value:0
*				0: unsigned thresholds
*				1: signed thresholds
*			4:-
*			3:-
*			2:THR3_MA
*				Default value:0
*				0: no action
*				1: threshold 3 limit value for axis and sign mask reset (MASKA_1)
*			1:R_TAM		Next condition validation flag
*				Default value:0
*				0: no valid next condition found
*				1: valid next condition found and reset
*			0:SITR
*				Default value:0
*				0: no actions
*				1: program flow can be modified by STOP and CONT commands
*/
#define LIS3DSH_SETT1_ADDR					0x5b
#define _LIS3DSH_P_DET		7
#define _LIS3DSH_THR3_SA	6
#define _LIS3DSH_ABS		5
#define _LIS3DSH_THR3_MA	2
#define _LIS3DSH_R_TAM		1
#define _LIS3DSH_SITR		0

/*	Rejestr PR1 -------------- Program-reset pointer ----------------------------------------------
*	Default value: ---
*	Read only register
*
*	Program and reset pointer for SM1 motion detection operation.
*
*		bit:
*			7:PP3		PP[3:0] SM1 program pointer address
*			6:PP2
*			5:PP1
*			4:PP0
*			3:PR3		PR[3:0] SM1 reset pointer address
*			2:PR2
*			1:PR1
*			0:PR0
*/
#define LIS3DSH_RP1_ADDR					0x5c
#define _LIS3DSH_PP3		7
#define _LIS3DSH_PP2		6
#define _LIS3DSH_PP1		5
#define _LIS3DSH_PP0		4
#define _LIS3DSH_PR3		3
#define _LIS3DSH_PR2		2
#define _LIS3DSH_PR1		1
#define _LIS3DSH_PR0		0

