kvzhao/FreeRTOS-STM32F4/Libraries/STM32F4xx_StdPeriph_Driver/inc/stm32f4_discovery_lis3dsh.h
/*	Rejestr TC1 -------------- Timer counter ------------------------------------------------------
*	Default value: ---
*	Read only registers
*
*	16-bit general timer (unsigned output value) for SM1 operation timing.
*/
#define LIS3DSH_TC1_L_ADDR					0x5d
#define LIS3DSH_TC1_H_ADDR					0x5e

/*	Rejestr OUTS1 ------------ Main set flag ------------------------------------------------------
*	Default value: ---
*	Read only register
*
*	Output flags on axis for interrupt SM1 management.
*
*		bit:
*			7:P_X
*				0: X + no show
*				1: X + show
*			6:N_X
*				0: X - no show
*				1: X - show
*			5:P_Y
*				0: X + no show
*				1: X + show
*			4:N_Y
*				0: X - no show
*				1: X - show
*			3:P_Z
*				0: X + no show
*				1: X + show
*			2:N_Z
*				0: X - no show
*				1: X - show
*			1:P_V
*				0: X + no show
*				1: X + show
*			0:N_V
*				0: X - no show
*				1: X - show
*/
#define LIS3DSH_OUTS1_ADDR					0x5f
#define _LIS3DSH_P_X		7
#define _LIS3DSH_N_X		6
#define _LIS3DSH_P_Y		5
#define _LIS3DSH_N_Y		4
#define _LIS3DSH_P_Z		3
#define _LIS3DSH_N_Z		2
#define _LIS3DSH_P_V		1
#define _LIS3DSH_N_V		0

/*	Rejestr PEAK1 ------------ Peak value ---------------------------------------------------------
*	Default value: ---
*	Read only register
*
*	Peak detection value register for SM1 operation.
*/
#define LIS3DSH_PEAK1_ADDR					0x19

/*	Rejestr CTRL_REG2 -------- SM2 control register -----------------------------------------------
*	Default value: ---
*	Read/write register
*
*	State program 2 interrupt MNG - SM2 control register.
*
*		bit:
*			7:HYST2_2		HYST2_2:HYST0_2 Hysteresis unsigned value to be added
*							or subtracted from threshold value in SM2.
*			6:HYST1_2
*			5:HYST0_2
*				Default value: 000
*			4:-
*			3:SM2_PIN
*				Default value: 0
*				0: SM2 interrupt routed to INT1
*				1: SM2 interrupt routed to INT1 pin.
*			2:-
*			1:-
*			0:SM2_EN
*				Default value: 0
*				0: SM2 disabled
*				1: SM2 enabled
*/
#define LIS3DSH_CTRL_REG2_ADDR				0x22
#define _LIS3DSH_HYST2_2		7
#define _LIS3DSH_HYST1_2		6
#define _LIS3DSH_HYST0_2		5
#define _LIS3DSH_SM2_PIN		3
#define _LIS3DSH_SM2_EN			0

/*	Rejestrs ST2_1-ST2_16 ---- SM2 code registers [1-16] ------------------------------------------
*	Default value: ---
*	Write only registers
*
*	State machine 2 system register is made up of 16 8-bit registers,
*	to implement 16-step op-code.
*/
#define LIS3DSH_ST2_1_ADDR					0x60
#define LIS3DSH_ST2_2_ADDR					0x61
#define LIS3DSH_ST2_3_ADDR					0x62
#define LIS3DSH_ST2_4_ADDR					0x63
#define LIS3DSH_ST2_5_ADDR					0x64
#define LIS3DSH_ST2_6_ADDR					0x65
#define LIS3DSH_ST2_7_ADDR					0x66
#define LIS3DSH_ST2_8_ADDR					0x67
#define LIS3DSH_ST2_9_ADDR					0x68
#define LIS3DSH_ST2_10_ADDR					0x69
#define LIS3DSH_ST2_11_ADDR					0x6a
#define LIS3DSH_ST2_12_ADDR					0x6b
#define LIS3DSH_ST2_13_ADDR					0x6c
#define LIS3DSH_ST2_14_ADDR					0x6d
#define LIS3DSH_ST2_15_ADDR					0x6e
#define LIS3DSH_ST2_16_ADDR					0x6f

/*	Rejestr TIM4_2 ----------- SM2 general timer --------------------------------------------------
*	Default value: ---
*	Write only register
*
*	8-bit general timer (unsigned value) for SM2 operation timing.
*/
#define LIS3DSH_TIM4_2_ADDR					0x70

/*	Rejestr TIM3_2 ----------- SM2 general timer --------------------------------------------------
*	Default value: ---
*	Write only register
*
*	8-bit general timer (unsigned value) for SM2 operation timing.
*/
#define LIS3DSH_TIM3_2_ADDR					0x71

/*	Rejestr TIM2_2 ----------- SM2 general timer --------------------------------------------------
*	Default value: ---
*	Write only register
*
*	16-bit general timer (unsigned value) for SM2 operation timing.
*/
#define LIS3DSH_TIM2_2_L_ADDR				0x72
#define LIS3DSH_TIM2_2_H_ADDR				0x73

/*	Rejestr TIM1_2 ----------- SM2 general timer --------------------------------------------------
*	Default value: ---
*	Write only register
*
*	16-bit general timer (unsigned value) for SM2 operation timing.
*/
#define LIS3DSH_TIM1_2_L_ADDR				0x74
#define LIS3DSH_TIM1_2_H_ADDR				0x75

/*	Rejestr THRS2_2 ---------- SM2 threshold value 1 ----------------------------------------------
*	Default value: ---
*	Write only register
*
*	Threshold signed value for SM2 operation.
*/
#define LIS3DSH_THRS2_2_ADDR				0x76

/*	Rejestr THRS1_2 ---------- SM2 threshold value 2 ----------------------------------------------
*	Default value: ---
*	Write only register
*
*	Threshold signed value for SM2 operation.
*/
#define LIS3DSH_THRS1_2_ADDR				0x77

/*Rejestr MASK2_B ------------ SM2 axis and sign mask ---------------------------------------------
*	Default value: ---
*	Write only register
*
*	Axis and sign mask (swap) for SM2 motion detection operation.
*
*		bit:
*			7:P_X
*				0: X + disabled
*				1: X + enabled
*			6:N_X
*				0: X - disabled
*				1: X – enabled
*			5:P_Y
*				0: X + disabled
*				1: X + enabled
*			4:N_Y
*				0: X - disabled
*				1: X – enabled
*			3:P_Z
*				0: X + disabled
*				1: X + enabled
*			2:N_Z
*				0: X - disabled
*				1: X – enabled
*			1:P_V
*				0: X + disabled
*				1: X + enabled
*			0:N_V
*				0: X - disabled
*				1: X – enabled
*/
#define LIS3DSH_MASK2_B_ADDR				0x79
#define _LIS3DSH_P_X		7
#define _LIS3DSH_N_X		6
#define _LIS3DSH_P_Y		5
#define _LIS3DSH_N_Y		4
#define _LIS3DSH_P_Z		3
#define _LIS3DSH_N_Z		2
#define _LIS3DSH_P_V		1
#define _LIS3DSH_N_V		0

/*	Rejestr MASK2_A ---------- SM2 axis and sign mask ---------------------------------------------
*	Default value: ---
*	Write only register
*
*	Axis and sign mask (default) for SM2 motion detection operation.
*
*		bit:
*			7:P_X
*				0: X + disabled
*				1: X + enabled
*			6:N_X
*				0: X - disabled
*				1: X – enabled
*			5:P_Y
*				0: X + disabled
*				1: X + enabled
*			4:N_Y
*				0: X - disabled
*				1: X – enabled
*			3:P_Z
*				0: X + disabled
*				1: X + enabled
*			2:N_Z
*				0: X - disabled
*				1: X – enabled
*			1:P_V
*				0: X + disabled
*				1: X + enabled
*			0:N_V
*				0: X - disabled
*				1: X – enabled
*/
#define LIS3DSH_MASK2_A_ADDR				0x7a
#define _LIS3DSH_P_X		7
#define _LIS3DSH_N_X		6
#define _LIS3DSH_P_Y		5
#define _LIS3DSH_N_Y		4
#define _LIS3DSH_P_Z		3
#define _LIS3DSH_N_Z		2
#define _LIS3DSH_P_V		1
#define _LIS3DSH_N_V		0

